tutorials/heatTransfer/buoyantSimpleFoam/buoyantCavity/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-04;

boundaryField
{
    frontAndBack
    {
        type            compressible::kqRWallFunction;
        value           uniform 3.75e-04;
    }
    topAndBottom
    {
        type            compressible::kqRWallFunction;
        value           uniform 3.75e-04;
    }
    hot
    {
        type            compressible::kqRWallFunction;
        value           uniform 3.75e-04;
    }
    cold
    {
        type            compressible::kqRWallFunction;
        value           uniform 3.75e-04;
    }
}


// ************************************************************************* //
